```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # module.provision_apps[0].helm_release.calico will be updated in-place
  ~ resource "helm_release" "calico" {
      ~ id                         = "tigera-operator" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v3.31.1" -> (known after apply)
          ~ chart          = "tigera-operator" -> (known after apply)
          ~ first_deployed = 1748546096 -> (known after apply)
          ~ last_deployed  = 1763331142 -> (known after apply)
          ~ name           = "tigera-operator" -> (known after apply)
          ~ namespace      = "tigera-operator" -> (known after apply)
          ~ notes          = "" -> (known after apply)
          ~ revision       = 14 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - defaultFelixConfiguration = {
                      - enabled                  = true
                      - prometheusMetricsEnabled = true
                    }
                  - installation              = {
                      - calicoNetwork    = {
                          - bgp            = "Disabled"
                          - ipPools        = [
                              - {
                                  - blockSize     = 24
                                  - cidr          = "172.27.0.0/21"
                                  - encapsulation = "VXLANCrossSubnet"
                                  - natOutgoing   = "Enabled"
                                  - nodeSelector  = "all()"
                                },
                            ]
                          - linuxDataplane = "BPF"
                        }
                      - registry         = "quay.io"
                      - typhaMetricsPort = 9093
                    }
                  - kubernetesServiceEndpoint = {
                      - host = "10.0.0.241"
                      - port = "6443"
                    }
                }
            ) -> (known after apply)
          ~ version        = "v3.31.1" -> (known after apply)
        } -> (known after apply)
        name                       = "tigera-operator"
      ~ set_wo                     = (write-only attribute)
      ~ version                    = "3.31.1" -> "3.31.2"
        # (28 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```